Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/edc/PIC32CX1025MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PASSR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044278">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PASSR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004427C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PASPLIT0" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT1" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT2" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT3" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT4" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT5" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT6" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="PASPLIT7" edc:nzwidth="0x4" edc:desc="Protected Areas Split for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044280">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044284">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044288">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004428C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044290">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044294">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40044298">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004429C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX1" edc:cname="MATRIX1_PRTSR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400442BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX1">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
