Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/edc/PIC32CX1025MTSH128S1.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050624"/>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_IO_RETENTION" edc:nzwidth="0x20" edc:access="---------------nnnnn-nnnnnnnnnnn" edc:impl="0x1F7FF" edc:_addr="0x40050630">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="PA_7_0" edc:nzwidth="0x1" edc:desc="Keep Function on PA0 to PA7"/>
            <edc:SFRFieldDef edc:cname="PA_15_8" edc:nzwidth="0x1" edc:desc="Keep Function on PA8 to PA15"/>
            <edc:SFRFieldDef edc:cname="PA_23_16" edc:nzwidth="0x1" edc:desc="Keep Function on PA16 to PA23"/>
            <edc:SFRFieldDef edc:cname="PA_31_24" edc:nzwidth="0x1" edc:desc="Keep Function on PA24 to PA31"/>
            <edc:SFRFieldDef edc:cname="PB_7_0" edc:nzwidth="0x1" edc:desc="Keep Function on PB0 to PB7"/>
            <edc:SFRFieldDef edc:cname="PB_15_8" edc:nzwidth="0x1" edc:desc="Keep Function on PB8 to PB15"/>
            <edc:SFRFieldDef edc:cname="PB_23_16" edc:nzwidth="0x1" edc:desc="Keep Function on PB216 to PB23"/>
            <edc:SFRFieldDef edc:cname="PB_26_24" edc:nzwidth="0x1" edc:desc="Keep Function on PB24 to PB26"/>
            <edc:SFRFieldDef edc:cname="PC_7_0" edc:nzwidth="0x1" edc:desc="Keep Function on PC0 to PC7"/>
            <edc:SFRFieldDef edc:cname="PC_15_8" edc:nzwidth="0x1" edc:desc="Keep Function on PC8 to PC15"/>
            <edc:SFRFieldDef edc:cname="PC_22_16" edc:nzwidth="0x1" edc:desc="Keep Function on PC16 to PC22"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PD_7_0" edc:nzwidth="0x1" edc:desc="Keep Function on PD0 to PD7"/>
            <edc:SFRFieldDef edc:cname="PD_15_8" edc:nzwidth="0x1" edc:desc="Keep Function on PD8 to PD15"/>
            <edc:SFRFieldDef edc:cname="PD_23_16" edc:nzwidth="0x1" edc:desc="Keep Function on PD16 to PD23"/>
            <edc:SFRFieldDef edc:cname="PD_30_24" edc:nzwidth="0x1" edc:desc="Keep Function on PD24 to PD30"/>
            <edc:SFRFieldDef edc:cname="NRST" edc:nzwidth="0x1" edc:desc="Keep Function on NRST"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050634"/>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_BODCORE" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40050640">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="STATUS" edc:nzwidth="0x1" edc:desc="Core Brownout Detector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40050644"/>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_PWS_CNTRL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40050650">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="UNMASK" edc:nzwidth="0x1" edc:desc="Unmask Power Switch Control Signals"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x90" edc:_addr="0x40050654"/>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400506E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534652"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_WPSR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFF01" edc:_addr="0x400506E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPSRC" edc:nzwidth="0x10" edc:desc="Write Protection Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400506EC"/>
      <edc:SFRDef ltx:memberofperipheral="SFRBU" edc:cname="SFRBU_SPARE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400506F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFRBU">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x20" edc:desc="Spare"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x190C" edc:_addr="0x400506F4"/>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_CR" edc:nzwidth="0x20" edc:access="wwwwwwww-------------------w---w" edc:impl="0xFF000011" edc:_addr="0x40052000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:nzwidth="0x1" edc:desc="Watchdog Restart"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LOCKMR" edc:nzwidth="0x1" edc:desc="Lock Mode Register Write Access"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_MR" edc:nzwidth="0x20" edc:access="-nnn---------------n--n---nn----" edc:impl="0x70001230" edc:_addr="0x40052004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PERIODRST" edc:nzwidth="0x1" edc:desc="Watchdog Overflow Period Reset Enable"/>
            <edc:SFRFieldDef edc:cname="RPTHRST" edc:nzwidth="0x1" edc:desc="Repeat Threshold Reset Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WDNRSTDIS" edc:nzwidth="0x1" edc:desc="Watchdog Reset NRST Pin Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDDIS" edc:nzwidth="0x1" edc:desc="Watchdog Disable"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="WDIDLEHLT" edc:nzwidth="0x1" edc:desc="Watchdog Idle Halt"/>
            <edc:SFRFieldDef edc:cname="WDDBG0HLT" edc:nzwidth="0x1" edc:desc="Watchdog Core 0 Debug Halt"/>
            <edc:SFRFieldDef edc:cname="WDDBG1HLT" edc:nzwidth="0x1" edc:desc="Watchdog Core 1 Debug Halt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_VR" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:impl="0xFFF" edc:_addr="0x40052008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="COUNTER" edc:nzwidth="0xC" edc:desc="Watchdog Down Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_WL" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFF0FFF" edc:_addr="0x4005200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="PERIOD" edc:nzwidth="0xC" edc:desc="Watchdog Period"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RPTH" edc:nzwidth="0xC" edc:desc="Repeat Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DWDT" edc:cname="WDT1_IL" edc:nzwidth="0x20" edc:access="-------------nnn----nnnnnnnnnnnn" edc:impl="0x70FFF" edc:_addr="0x40052010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWDT">
            <edc:SFRFieldDef edc:cname="LVLTH" edc:nzwidth="0xC" edc:desc="Level Threshold"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x3" edc:desc="Prescaler Ratio">
              <edc:SFRFieldSemantic edc:cname="RATIO128" edc:desc="The watchdog counter decreased when the prescaler reaches 128." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RATIO64" edc:desc="The watchdog counter decreased when the prescaler reaches 64." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RATIO32" edc:desc="The watchdog counter decreased when the prescaler reaches 32." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RATIO16" edc:desc="The watchdog counter decreased when the prescaler reaches 16." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="RATIO8" edc:desc="The watchdog counter decreased when the prescaler reaches 8." edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RATIO4" edc:desc="The watchdog counter decreased when the prescaler reaches 4." edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="RATIO2" edc:desc="The watchdog counter decreased when the prescaler reaches 2." edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="RATIO1" edc:desc="The watchdog counter decreased when the prescaler reaches 1." edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
