Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/edc/PIC32CX1025MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_CTRL1" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x46800010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MUL" edc:nzwidth="0x10" edc:desc="Multiplier Factor Value for PLLA, B and C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_CTRL2" edc:nzwidth="0x20" edc:access="----------nnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFFF" edc:_addr="0x46800014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FRACR" edc:nzwidth="0x16" edc:desc="Fractional Loop Divider Setting"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_SSR" edc:nzwidth="0x20" edc:access="---n----nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x10FFFFFF" edc:_addr="0x46800018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="STEP" edc:nzwidth="0x10" edc:desc="Spread Spectrum Step Size"/>
            <edc:SFRFieldDef edc:cname="NSTEP" edc:nzwidth="0x8" edc:desc="Spread Spectrum Number of Step"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ENSPREAD" edc:nzwidth="0x1" edc:desc="Spread Spectrum Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_ACR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----nnnnnnnnnnnn" edc:impl="0xFFFF0FFF" edc:_addr="0x4680001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CONTROL" edc:nzwidth="0xC" edc:desc="PLL Control Value Selection"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LOCK_THR" edc:nzwidth="0x8" edc:desc="PLL Lock Threshold Value Selection"/>
            <edc:SFRFieldDef edc:cname="LOOP_FILTER" edc:nzwidth="0x8" edc:desc="PLL Loop Filter Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_UPDT" edc:nzwidth="0x20" edc:access="--------nnnnnnnn-------n----nnnn" edc:impl="0xFF010F" edc:_addr="0x46800020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x4" edc:desc="PLL ID"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="UPDATE" edc:nzwidth="0x1" edc:desc="PLL Setting Update (write-only)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="STUPTIM" edc:nzwidth="0x8" edc:desc="Start-up Time"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_MOR" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnnnnnnnnnn----nnnn" edc:impl="0xFFFFF0F" edc:_addr="0x46800024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTEN" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCXTBY" edc:nzwidth="0x1" edc:desc="12 to 48 MHz Crystal Oscillator Bypass"/>
            <edc:SFRFieldDef edc:cname="WAITMODE" edc:nzwidth="0x1" edc:desc="Wait Mode Command (write-only)"/>
            <edc:SFRFieldDef edc:cname="MOSCRCEN" edc:nzwidth="0x1" edc:desc="Main RC Oscillator Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCXTST" edc:nzwidth="0x8" edc:desc="Main Crystal Oscillator Start-up Time"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Write Access Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFF) == 0x37"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MOSCSEL" edc:nzwidth="0x1" edc:desc="Main Clock Oscillator Selection">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The main RC oscillator is selected." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="XT" edc:desc="The main crystal oscillator is selected." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:SFRFieldDef edc:cname="XT32KFME" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Frequency Monitoring Enable"/>
            <edc:SFRFieldDef edc:cname="BMCKRST" edc:nzwidth="0x1" edc:desc="Bad MCK0 Clock Reset Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_MCFR" edc:nzwidth="0x20" edc:access="-------n---n---nnnnnnnnnnnnnnnnn" edc:impl="0x111FFFF" edc:_addr="0x46800028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MAINF" edc:nzwidth="0x10" edc:desc="Main Clock Frequency"/>
            <edc:SFRFieldDef edc:cname="MAINFRDY" edc:nzwidth="0x1" edc:desc="Main Clock Frequency Measure Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RCMEAS" edc:nzwidth="0x1" edc:desc="RC Oscillator Frequency Measure (write-only)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCSS" edc:nzwidth="0x1" edc:desc="Counter Clock Source Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CPU_CKR" edc:nzwidth="0x20" edc:access="-----nnnnnnn-nnn---------nnn--nn" edc:impl="0x7F70073" edc:_addr="0x4680002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x2" edc:desc="Processor (CPU_CLK0) and Master Clock (MCK0) Source Selection">
              <edc:SFRFieldSemantic edc:cname="MD_SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAINCK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLLACK1" edc:desc="PLLACK1 is selected" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PLLBCK" edc:desc="PLLBCK is selected" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x3" edc:desc="Processor (CPU_CLK0) and Master Clock (MCK0) Prescaler">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="CLK_3" edc:desc="Selected clock divided by 3" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPCSS" edc:nzwidth="0x3" edc:desc="Coprocessor MCK1 Source Selection">
              <edc:SFRFieldSemantic edc:cname="MD_SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAINCK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MCK0" edc:desc="MCK0 is selected" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PLLACK1" edc:desc="PLLACK1 is selected" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="PLLBCK" edc:desc="PLLBCK is selected" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="PLLCCK" edc:desc="PLLCCK is selected" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPPRES" edc:nzwidth="0x4" edc:desc="Coprocessor MCK1 Prescaler">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLK_3" edc:desc="Selected clock divided by 3" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CLK_5" edc:desc="Selected clock divided by 5" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CLK_6" edc:desc="Selected clock divided by 6" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CLK_7" edc:desc="Selected clock divided by 7" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="CLK_9" edc:desc="Selected clock divided by 9" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CLK_10" edc:desc="Selected clock divided by 10" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="CLK_11" edc:desc="Selected clock divided by 11" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="CLK_12" edc:desc="Selected clock divided by 12" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CLK_13" edc:desc="Selected clock divided by 13" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="CLK_14" edc:desc="Selected clock divided by 14" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="CLK_15" edc:desc="Selected clock divided by 15" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RATIO_MCK0DIV" edc:nzwidth="0x1" edc:desc="MCK0 Clock Frequency Division for MCK0DIV Clock"/>
            <edc:SFRFieldDef edc:cname="RATIO_MCK1DIV" edc:nzwidth="0x1" edc:desc="MCK1 Clock Frequency Division for MCK1DIV Clock"/>
            <edc:SFRFieldDef edc:cname="RATIO_MCK0DIV2" edc:nzwidth="0x1" edc:desc="MCK0 Clock Frequency Division for MCK0DIV2 Clock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
