Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/edc/PIC32CX1025MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_DMA_DATA" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DATA32" edc:nzwidth="0x20" edc:desc="32-bit Data read by DMA"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="CHIDX" edc:nzwidth="0x8" edc:desc="Channel Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_DATA0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DATA32" edc:nzwidth="0x20" edc:desc="Low-pass Filter 32-bit Signed Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_DATA1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DATA32" edc:nzwidth="0x20" edc:desc="Low-pass Filter 32-bit Signed Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_DATA2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4800001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DATA32" edc:nzwidth="0x20" edc:desc="Low-pass Filter 32-bit Signed Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_DATA3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DATA32" edc:nzwidth="0x20" edc:desc="Low-pass Filter 32-bit Signed Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_DATA4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x48000024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DATA32" edc:nzwidth="0x20" edc:desc="Low-pass Filter 32-bit Signed Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x48000028"/>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_CHA_CFG1" edc:nzwidth="0x20" edc:access="--n--nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x27FFFFFF" edc:_addr="0x48000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="THRESH1" edc:nzwidth="0x18" edc:desc="Threshold 1 for Channel A"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x3" edc:desc="Channel A Index">
              <edc:SFRFieldSemantic edc:cname="CH0" edc:desc="Channel 0 is selected." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CH1" edc:desc="Channel 1 is selected." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CH2" edc:desc="Channel 2 is selected." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CH3" edc:desc="Channel 3 is selected." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CH4" edc:desc="Channel 4 is selected." edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CH5" edc:desc="Channel 5 is selected." edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CH6" edc:desc="Channel 6 is selected." edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COND" edc:nzwidth="0x1" edc:desc="Condition Applied for Detection on Channel A">
              <edc:SFRFieldSemantic edc:cname="OR" edc:desc="Selected channel data is lower than THRESH1 OR higher than THRESH2." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AND" edc:desc="Selected channel data is lower than THRESH1 AND higher than THRESH2." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_CHB_CFG1" edc:nzwidth="0x20" edc:access="--n--nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x27FFFFFF" edc:_addr="0x48000044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="THRESH1" edc:nzwidth="0x18" edc:desc="Threshold 1 for Channel B"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x3" edc:desc="Channel B Index">
              <edc:SFRFieldSemantic edc:cname="CH0" edc:desc="Channel 0 is selected." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CH1" edc:desc="Channel 1 is selected." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CH2" edc:desc="Channel 2 is selected." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CH3" edc:desc="Channel 3 is selected." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CH4" edc:desc="Channel 4 is selected." edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CH5" edc:desc="Channel 5 is selected." edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CH6" edc:desc="Channel 6 is selected." edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COND" edc:nzwidth="0x1" edc:desc="Condition Applied for Detection on Channel B">
              <edc:SFRFieldSemantic edc:cname="OR" edc:desc="Selected channel data is lower than THRESH1 OR higher than THRESH2." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AND" edc:desc="Selected channel data is lower than THRESH1 AND higher than THRESH2." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_CHA_CFG2" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x48000048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="THRESH2" edc:nzwidth="0x18" edc:desc="Threshold 2 for Channel A"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_CHB_CFG2" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4800004C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="THRESH2" edc:nzwidth="0x18" edc:desc="Threshold 2 for Channel B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
