Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/edc/PIC32CX1025MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_IER" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x48000050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Underflow Flow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CHCHG" edc:nzwidth="0x1" edc:desc="Channel Data Change Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CHDIFF" edc:nzwidth="0x1" edc:desc="Comparison Flag Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PARERROR" edc:nzwidth="0x1" edc:desc="Parity Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="PDC Receive Transfer End Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="PDC Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CHAEVT" edc:nzwidth="0x1" edc:desc="Channel A Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CHBEVT" edc:nzwidth="0x1" edc:desc="Channel B Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_IDR" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x48000054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Underflow Flow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHCHG" edc:nzwidth="0x1" edc:desc="Channel Data Change Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHDIFF" edc:nzwidth="0x1" edc:desc="Comparison Flag Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PARERROR" edc:nzwidth="0x1" edc:desc="Parity Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="PDC Receive Transfer End Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="PDC Receive Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHAEVT" edc:nzwidth="0x1" edc:desc="Threshold Channel A Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHBEVT" edc:nzwidth="0x1" edc:desc="Threshold Channel B Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_IMR" edc:nzwidth="0x20" edc:access="---------------------rrrrrrrrrrr" edc:impl="0x7FF" edc:_addr="0x48000058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Underflow Flow Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHCHG" edc:nzwidth="0x1" edc:desc="Channel Data Change Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHDIFF" edc:nzwidth="0x1" edc:desc="Comparison Flag Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PARERROR" edc:nzwidth="0x1" edc:desc="Parity Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="PDC Receive Transfer End Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="PDC Receive Buffer Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHAEVT" edc:nzwidth="0x1" edc:desc="Channel A Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHBEVT" edc:nzwidth="0x1" edc:desc="Channel B Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EMAFE" edc:cname="EMAFE_ISR" edc:nzwidth="0x20" edc:access="---------------------rrrrrrrrrrr" edc:impl="0x7FF" edc:_addr="0x4800005C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EMAFE">
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXUDR" edc:nzwidth="0x1" edc:desc="Receive Under Flow (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXFULL" edc:nzwidth="0x1" edc:desc="Receive FIFO Full (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RXEMPTY" edc:nzwidth="0x1" edc:desc="Receive FIFO Empty (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CHCHG" edc:nzwidth="0x1" edc:desc="Channel Data Variation Detection Event (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CHDIFF" edc:nzwidth="0x1" edc:desc="Channel Difference Comparison Event (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="PARERROR" edc:nzwidth="0x1" edc:desc="Parity Error Event (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="PDC Receive Transfer End Event (cleared by writing EMAFE_RCR or EMAFE_RNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="PDC Receive Buffer Full Event (cleared by writing EMAFE_RCR or EMAFE_RNCR)"/>
            <edc:SFRFieldDef edc:cname="CHAEVT" edc:nzwidth="0x1" edc:desc="Channel A Event (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CHBEVT" edc:nzwidth="0x1" edc:desc="Channel B Event (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
