Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/edc/PIC32CX1025MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PIO1" edc:cname="PIO_GROUP2PIO1_ISR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4800C0AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO1">
            <edc:SFRFieldDef edc:cname="P0" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P1" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P2" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P3" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P4" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P5" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P6" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P7" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P8" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P9" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P10" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P11" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P12" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P13" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P14" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P15" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P16" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P17" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P18" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P19" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P20" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P21" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P22" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P23" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P24" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P25" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P26" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P27" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P28" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P29" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P30" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
            <edc:SFRFieldDef edc:cname="P31" edc:nzwidth="0x1" edc:desc="Input Change Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4800C0B0"/>
      <edc:SFRDef ltx:memberofperipheral="PIO1" edc:cname="PIO_GROUP2PIO1_IOFR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwww------ww" edc:impl="0xFFFFFF03" edc:_addr="0x4800C0BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO1">
            <edc:SFRFieldDef edc:cname="FPHY" edc:nzwidth="0x1" edc:desc="Freeze Physical Configuration"/>
            <edc:SFRFieldDef edc:cname="FINT" edc:nzwidth="0x1" edc:desc="Freeze Interrupt Configuration"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="FRZKEY" edc:nzwidth="0x18" edc:desc="Freeze Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit." edc:when="(field &amp; 0xFFFFFF) == 0x494F46"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x520" edc:_addr="0x4800C0C0"/>
      <edc:SFRDef ltx:memberofperipheral="PIO1" edc:cname="PIO1_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------nn" edc:impl="0xFFFFFF03" edc:_addr="0x4800C5E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x50494F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIO1" edc:cname="PIO1_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x4800C5E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIO1">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
