Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/edc/PIC32CX1025MTSH128S1.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_FPE" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4801C06C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="FPE0" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 0"/>
            <edc:SFRFieldDef edc:cname="FPE1" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 1"/>
            <edc:SFRFieldDef edc:cname="FPE2" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4801C070"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_ELMR0" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4801C07C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:nzwidth="0x1" edc:desc="Comparison 0 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:nzwidth="0x1" edc:desc="Comparison 1 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:nzwidth="0x1" edc:desc="Comparison 2 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:nzwidth="0x1" edc:desc="Comparison 3 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:nzwidth="0x1" edc:desc="Comparison 4 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:nzwidth="0x1" edc:desc="Comparison 5 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:nzwidth="0x1" edc:desc="Comparison 6 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:nzwidth="0x1" edc:desc="Comparison 7 Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x4801C080"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_SSPR" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4801C0A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="SPRD" edc:nzwidth="0x18" edc:desc="Spread Spectrum Limit Value"/>
            <edc:SFRFieldDef edc:cname="SPRDM" edc:nzwidth="0x1" edc:desc="Spread Spectrum Counter Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_SSPUP" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4801C0A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="SPRDUP" edc:nzwidth="0x18" edc:desc="Spread Spectrum Limit Value Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4801C0A8"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_DEBUG" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x4801C0AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="OUTMODE" edc:nzwidth="0x1" edc:desc="PWM Output Mode when System is in Debug Mode">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="Keeps the PWM outputs running when the processor reports a debug operating mode." edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_SMMR" edc:nzwidth="0x20" edc:access="---------------n---------------n" edc:impl="0x10001" edc:_addr="0x4801C0B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="GCEN0" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="DOWN0" edc:nzwidth="0x1" edc:desc="Down Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4801C0B4"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_FPV2" edc:nzwidth="0x20" edc:access="-------------nnn-------------nnn" edc:impl="0x70007" edc:_addr="0x4801C0C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="FPZH0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZH1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZH2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 2"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="FPZL0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZL1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZL2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x4801C0C4"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_WPCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4801C0E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="WPCMD" edc:nzwidth="0x2" edc:desc="Write Protection Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE_SW_PROT" edc:desc="Disables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_SW_PROT" edc:desc="Enables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_HW_PROT" edc:desc="Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WPRG0" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 0"/>
            <edc:SFRFieldDef edc:cname="WPRG1" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 1"/>
            <edc:SFRFieldDef edc:cname="WPRG2" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 2"/>
            <edc:SFRFieldDef edc:cname="WPRG3" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 3"/>
            <edc:SFRFieldDef edc:cname="WPRG4" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 4"/>
            <edc:SFRFieldDef edc:cname="WPRG5" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPCMD field. Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x50574D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_WPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrr--rrrrrrr-rrrrrr" edc:impl="0xFFFF3FBF" edc:_addr="0x4801C0E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="WPSWS0" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS1" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS2" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS3" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS4" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS5" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS0" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS1" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS2" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS3" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS4" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS5" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protect Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x4801C0EC"/>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_TPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4801C108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:nzwidth="0x20" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM" edc:cname="PWM_TCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4801C10C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
